{
  "probability": 0.18,
  "confidence": "high",
  "primary_factors": [
    "Main winter storm and Winter Storm Warning end Sunday at 10 AM, giving roughly 24 hours of cleanup before Monday’s commute.",
    "Forecast for Monday morning is dry with very cold but non-extreme temperatures (teens to 20s°F) and light winds, well above Michigan’s typical cold-closure thresholds.",
    "Only ~0.25\" of new snow is expected late Monday evening, long after school hours, with no ice or blizzard conditions during the day.",
    "Historical analogs for a quiet, cold day after a weekend storm in Kent County show relatively low closure rates (~5–25%), especially when the worst conditions do not coincide with the commute.",
    "Safety assessment scores primary and secondary roads, lots, and driving conditions as generally good (7–8/10) with only moderate ice risk, consistent with school being open.",
    "Michigan districts, including Rockford, routinely operate with significant snow on the ground as long as main routes are plowed and there is no active high-impact event during bus hours."
  ],
  "decision_rationale": "All three expert streams agree that the impactful winter weather is concentrated on Saturday and Sunday, with warnings expiring Sunday morning. By Monday, Dec 1, Rockford is cold but quiet: no measurable snow during the commute, light winds, improving visibility, and road crews having had a full day to clear primary routes and most secondaries. Historically, Kent County schools very rarely cancel in this pattern unless road crews are overwhelmed or an ice/blizzard component lingers into the pre-dawn hours, neither of which is indicated. The historical post-storm closure rates (0.2–0.25 at most) align with the safety assessment showing only moderate residual risk. Given Michigan’s higher tolerance and the lack of active hazards during bus times, a snow day is unlikely but not impossible if actual cleanup seriously lags or localized issues (power outages, unplowed rural routes) emerge.",
  "timestamp": "2025-11-29T14:04:25.205Z",
  "targetDate": "2025-12-01",
  "targetDayName": "Monday",
  "daysAhead": 2,
  "location": "Rockford, Michigan"
}