{
  "probability": 72,
  "confidence": "high",
  "primary_factors": [
    "~8.1\" storm-total snow with snow actively falling through the entire AM decision/commute window (3 AM–late morning)",
    "Heaviest snow rates aligned with buses/parent commute (peak ~7–9 AM; severe window ~5:30–10:30 AM)",
    "Poor visibility risk: frequent ~1 mile visibility with at least occasional near-zero in the dataset",
    "Plow-timing disadvantage: no true cleanup window before 7:40 AM because snow is still intensifying/re-covering treated roads",
    "Secondary/rural road risk for Rockford bus routes (slower treatment; higher stuck/slide-off risk)",
    "Non-zero underlying glaze risk from prior day light freezing rain (slick base under fresh snow), though precip type Wednesday is all snow",
    "No confirmed neighboring district closures yet (keeps probability from going even higher)"
  ],
  "decision_rationale": "Pre-decision checklist:\n1) Agreement: All four inputs align on a high-impact *timing* problem: snow begins ~3 AM, ramps up, and is worst during the 6–10 AM window with notable visibility reduction and difficult bus operations.\n2) Disagreement: The only real tension is “delay vs close.” History says Michigan can sometimes run on 7–9\" with a delay, but meteorology + safety emphasize that heavy snow persists well past 8 AM, making a delay less effective.\n3) Plow timing math: Snow does not meaningfully taper until early afternoon (~14:00). From snow onset (~03:00) to school start (~07:40) is ~4.5 hours, but it’s not a cleanup window—snow is actively falling and re-covering. Safety estimate: ~2.9\" by ~08:00 and meteorology estimate ~2.6\" by ~07:00, with ~6.2\" by ~10:00. That implies worsening roads *after* the decision point.\n4) Ice: No meaningful mixed precip Wednesday (all snow). Ice/glaze risk is low-to-moderate as an *underlayer* due to prior-day light freezing rain—enough to elevate slip/stop risk on untreated surfaces.\n5) Neighboring districts: News intel did not confirm any Jan 21 closures/delays posted yet. That removes the usual “domino” boost.\n6) What would make me wrong: If the heavy band shifts away and Rockford only gets ~4–6\" with improved visibility by 6–7 AM, districts could run with a delay or even open; alternatively, if multiple neighbors close overnight, closure odds would jump higher.\n\nWeighting (per directive): Meteorology 35% (8.1\" + peak 7–9 AM + visibility), Safety 25% (severe commute + limited plow advantage + secondary roads), History 20% (events like this often close when rates hit at decision time), News 20% (strong regional hazard context, but no confirmed neighbor closures for Jan 21).\n\nUsing Michigan thresholds: 8+ inches is generally 60–85% base. Because the heaviest snow aligns with the commute and visibility is a major limiter, I stay in that band. Because neighboring districts have not (yet) posted closures/delays, I avoid the upper end. Net: 72% closure probability for Rockford on Wed 1/21.",
  "timestamp": "2026-01-20T18:17:13.264Z",
  "targetDate": "2026-01-21",
  "targetDayName": "Wednesday",
  "daysAhead": 1,
  "location": "Rockford, Michigan"
}