{
  "probability": 0.22,
  "confidence": "high",
  "primary_factors": [
    "Total storm snowfall around 6–9\" (locally a bit higher) fits Michigan’s routine winter capabilities, especially once past the peak of the season.",
    "Heaviest snow and worst visibility occur Saturday night into Sunday morning, not during the Monday pre-dawn commute window.",
    "Snow ends and conditions steadily improve through Sunday with 12–18+ hours of dry time before Monday morning for plows to clear primary routes and most secondary roads.",
    "Temperatures stay below freezing with some refreeze and slick spots, but not extreme cold or wind chills low enough to independently drive closures.",
    "Historical analogs for similar weekend 6–10\" events with improving conditions by Sunday point to roughly 15–25% closure likelihood, consistent with the current forecast.",
    "Safety assessment shows moderate risk with primary roads expected to be in decent shape, and only localized issues on secondary roads, parking lots, and walking routes."
  ],
  "decision_rationale": "Forecast and expert analyses align on a significant but mainly weekend-focused storm: about 6.5\" of snow in Rockford with peak rates up to ~1.5\"/hr from late Saturday night through Sunday morning. The NWS Winter Storm Watch and 6–9\" call indicate impactful travel during the event, but timing is crucial—snow tapers by mid-morning Sunday with no new accumulation expected Sunday night into the Monday commute.\n\nMichigan-specific closure thresholds are higher than average. A 6–9\" event with the peak more than 24 hours before Monday’s start typically does not trigger widespread closures here. Historical pattern analogs for nearly identical setups—weekend heavy snow, quiet cold Monday—show closure rates most commonly in the 10–25% range. Infrastructure in Kent County is well-practiced at clearing after such storms, especially with a full day of Sunday cleanup plus overnight work.\n\nRoad and safety assessments show moderate risk: primary roads likely in fair winter shape, secondary roads and parking lots still slick but passable, and no major emergency access concerns. There is some refreeze risk with temps in the 20s, but this is standard for West Michigan and generally managed with salting and careful driving rather than full closures.\n\nWeighing all factors—snow amount, timing, Michigan tolerance, historical analogs, and safety analysis—the most defensible, decisive estimate for a full snow day on Monday, 2025-12-01 in Rockford, MI is 22%. This stays within the Michigan guideline band for a 4–6\"/6–8\" event with non-ideal but not dangerous timing, and it avoids overestimating closure odds when the main storm is already done a day earlier.",
  "timestamp": "2025-11-28T23:40:55.001Z",
  "targetDate": "2025-12-01",
  "targetDayName": "Monday",
  "daysAhead": 3,
  "location": "Rockford, Michigan"
}