{
  "probability": 0.18,
  "confidence": "high",
  "primary_factors": [
    "Forecast 8.6\" total snow, but bulk of accumulation occurs Saturday–Saturday night with Sunday available for cleanup before the next school day.",
    "Temperatures stay below freezing with 24+ hours of freezing conditions, supporting accumulation but also allowing plows/salt to work efficiently once rates ease.",
    "Historical analogs for similar 6–9\" late‑November storms with weekend timing in Kent County show roughly 20–30% closure rates, often resulting in normal Monday operations or at most delays.",
    "Safety assessment for the current (Friday) school day rates roads and travel at moderate risk but explicitly calls conditions marginal but manageable for a normal start, not closure‑level.",
    "No blizzard‑level winds or widespread prolonged whiteouts; visibility around 1 mile at times is impactful but below typical Michigan closure thresholds when it’s not overlapping the key commute window."
  ],
  "decision_rationale": "Using the Michigan-specific thresholds and the provided expert analyses, the key decision is for the next school day after this storm (Monday). The meteorological analysis shows a solid winter storm with about 8–9\" of snow, 1\"/hr peaks, temps in the 20s, and some blowing snow—but the bulk of this occurs from Saturday morning through late Saturday night, giving road crews all of Sunday to clear. In Michigan, where 4–8\" events are routine, this would only be a strong closure candidate if heavy snow and poorest visibility lined up directly with the Monday 5–8 AM window, which is not indicated here.\n\nThe historical pattern analysis for similar 6–9\" weekend storms in Kent County points to roughly a 20–30% snow‑day rate, with districts more often opening on time Monday. Infrastructure is well-prepared for events of this magnitude by late November, and there is no signal of extreme wind chills, ice storm conditions, or a second wave during the Monday commute. The safety assessment for the current day (Friday) explicitly describes conditions as marginal but manageable and suggests that Saturday–Sunday impacts are significant for travel yet not automatically disruptive to Monday operations.\n\nBalancing these, and applying the provided Michigan probability guidelines (8\"+ normally pushes toward a higher closure probability when timed during school hours), the weekend timing and strong plow capacity justify staying near the lower end of historical outcomes. I set the final probability at 18%: above the minimum for a routine event, but clearly in the \"unlikely to close\" range rather than a coin flip. This should be well-calibrated under a Brier-score metric given the analog data and timing specifics.",
  "timestamp": "2025-11-28T17:23:32.277Z",
  "location": "Rockford, Michigan"
}