{
  "probability": 0.18,
  "confidence": "high",
  "primary_factors": [
    "Storm totals in the 6–9\"+ range but with heaviest snow and worst visibility ending by late Sunday morning, more than 24 hours before the Monday commute",
    "Temperatures near/above freezing during Sunday daytime aiding cleanup, followed by refreeze but no additional accumulating snow Sunday night",
    "Kent County and Rockford Public Schools have strong capacity and experience handling 6–10\" weekend storms, with main routes typically cleared by Monday",
    "Forecast wind chills in the single digits/teens above zero—cold but not near Michigan’s typical extreme‑cold closure thresholds",
    "Historical analogs show Monday-after-weekend-storm closures are uncommon when snow ends 18–24+ hours before school and totals are under ~12\"",
    "Safety assessment shows primary roads likely passable with caution; main concern is localized ice on secondary roads and at bus stops, better suited to cautious operations or, at most, a delay"
  ],
  "decision_rationale": "Using the Michigan-specific thresholds and the detailed expert inputs, the key is timing and local tolerance.\n\nMeteorology: A solid 6–9\"+ event peaks Saturday evening through early Sunday with heavy snow and 1\"/hr rates, then tapers and ends by late Sunday morning. Sunday afternoon is breezy and in the mid‑30s, which promotes partial melt and cleanup rather than adding new accumulation. Sunday night is dry, cold, and mainly clear; no new significant snow is expected after early Sunday. Monday morning is cold with some wind but not dangerously so.\n\nOperations and history: Rockford and Kent County routinely handle 6–10\" storms. Historically, Monday-after-weekend-storm days where snow ends >18–24 hours before the bell and totals are under about a foot result in school being open far more often than closed. The provided analogs (0.4, 0.25, and 0.1 closure probabilities) all lean open, especially when adjusted for this event’s generous cleanup window and lack of extreme cold or active snowfall Monday.\n\nSafety: Primary roads score 7/10 and are expected to be treated and passable; secondary and parking lots are midrange but manageable with proper salting and scraping. The main hazard is refreeze/black ice on side streets, rural routes, bridge decks, and bus stops. That level of risk typically calls for cautious driving, early road checks, and perhaps a localized delay in a worst‑case refinement—not a default full closure, especially in a snow‑experienced district.\n\nMichigan thresholds: For a 6–9\" event with good timing and no Monday-morning snow, the baseline snow-day probability guidance is in the 35–50% range. However, that generic range assumes the snow is near the commute window. Here, the storm is effectively a full day earlier, which historically drops the effective closure odds substantially. Combining the meteorological setup, strong cleanup window, infrastructure capability, and historical behavior, a final probability near the low end of the 10–20% band is most consistent with actual outcomes.\n\nTo stay competitive on Brier score and be decisive, I set the final probability at 18%: low but not negligible, acknowledging the small chance that unexpected lingering bands, worse-than-expected refreeze, or conservative transportation calls could push the district to a delay or, less likely, a closure.",
  "timestamp": "2025-11-28T23:14:09.663Z",
  "targetDate": "2025-12-01",
  "targetDayName": "Monday",
  "daysAhead": 3,
  "location": "Rockford, Michigan"
}