{
  "probability": 0.27,
  "confidence": "high",
  "primary_factors": [
    "Forecast snowfall total around 8.5\" with most accumulation from late Saturday morning through late Saturday night, tapering by early Sunday, not during the Sunday night/Monday bus window.",
    "Temperatures remain below freezing for ~48 hours, so snow will stick, but this is a straightforward snow event with minimal ice and no blizzard-level winds or extreme cold.",
    "Kent County and Rockford have strong plow operations and high tolerance for 6–9\" weekend storms; main roads and most secondary routes are usually in decent shape by the next weekday after a Saturday–Sunday event.",
    "Historical analogs for similar 6–9\" storms with heavy snow outside of school commute windows show roughly 25–40% snow-day rates, lower than 8–10\" weekday storms directly impacting the 4–8 AM commute.",
    "Safety and road scores indicate moderate risk and difficult travel during the storm, but no persistent life-safety issues or infrastructure failures that would strongly force closure into Monday."
  ],
  "decision_rationale": "Using the Michigan-specific thresholds and the provided expert analyses, this event fits the 8+ inch, non-blizzard weekend storm profile. That would normally suggest a relatively high closure probability if the worst conditions coincided with a Monday morning commute, but the timing here is crucial: the heaviest snow falls Saturday afternoon through late Saturday night, tapering into early Sunday. That gives road commissions and school facilities most of Sunday to plow, salt, and clear parking lots.\n\nHistorical pattern data show 40–50% closure rates for similar 6–9\" events when the most intense snow overlaps the 4–8 AM school commute. Here, the heaviest bands occur more than 24 hours before buses would roll on Monday. Past behavior in Kent County indicates districts usually open on time after a weekend storm of this magnitude unless totals dramatically exceed forecasts, cleanup lags, or significant ice develops—none of which is strongly indicated in the current guidance.\n\nMeteorological analysis confirms: roughly 8.5\" total, steady subfreezing temperatures, wind chills in the teens, and sustained but not extreme winds (around 10–15 mph). Visibility may drop to about 1 mile during peak snowfall, but that will mostly be on Saturday. The NWS Winter Storm Watch emphasizes difficult travel, not crippling blizzard or ice-storm conditions. Safety assessment scores point to moderate risk and difficult but manageable travel, with primary roads likely to be in good shape by the next weekday under normal operations.\n\nGiven Michigan’s higher threshold for closures, the weekend-focused timing, and capable plow infrastructure, a full snow day for Rockford Public Schools on Monday is possible but not likely. To remain competitive on Brier score while being decisive, I place the probability at 27%, squarely in the low-to-moderate range consistent with 8+ inches falling well before the school day.",
  "timestamp": "2025-11-28T18:24:16.685Z",
  "location": "Rockford, Michigan"
}